### 4. 데이터프레임 데이터 조작

In [1]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기

In [2]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [3]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [4]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [5]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [6]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [7]:
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [8]:
np.random.seed = (2023)
df = pd.DataFrame(np.random.randint(40,101,size=(4,5)),
                    index = list('abcd'), columns = list('VWXYZ'))
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [9]:
df.sort_values(by='V',ascending=False)

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [10]:
# V 열에 동일한 값이 있으면, 동일한 같은 W 열을 보고 정렬
df2 = df.sort_values(by=['V','W'],ascending=False)
df2

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [11]:
titanic = sns.load_dataset('titanic')
titanic
print(titanic['sex'].value_counts())
print(titanic['class'].value_counts())
print(titanic['alive'].value_counts())

sex
male      577
female    314
Name: count, dtype: int64
class
Third     491
First     216
Second    184
Name: count, dtype: int64
alive
no     549
yes    342
Name: count, dtype: int64

- 행과 열의 합계

In [12]:
df

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [13]:
# 행방향 열의 합
df.sum(axis=0)

V    279
W    330
X    336
Y    209
Z    254
dtype: int64

In [14]:
# 열 방향 행의 합
df.sum(axis=1)

a    413
b    359
c    311
d    325
dtype: int64

In [15]:
# 총점 열
df['총점'] = df.sum(axis=1)
df

    V   W    X   Y   Z   총점
a  83  91   79  78  82  413
b  73  98  100  43  45  359
c  64  44   86  46  71  311
d  59  97   71  42  56  325

In [16]:
# 평균 열
df['평균'] = df[['V','W','X','Y','Z']].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균
a  83  91   79  78  82  413  82.6
b  73  98  100  43  45  359  71.8
c  64  44   86  46  71  311  62.2
d  59  97   71  42  56  325  65.0

In [17]:
df['평균2'] = df.iloc[:,:5].mean(axis=1)
df

    V   W    X   Y   Z   총점    평균   평균2
a  83  91   79  78  82  413  82.6  82.6
b  73  98  100  43  45  359  71.8  71.8
c  64  44   86  46  71  311  62.2  62.2
d  59  97   71  42  56  325  65.0  65.0

In [18]:
# 행추가
df.loc['합계', :] = df.sum()
df

        V      W      X      Y      Z      총점     평균    평균2
a    83.0   91.0   79.0   78.0   82.0   413.0   82.6   82.6
b    73.0   98.0  100.0   43.0   45.0   359.0   71.8   71.8
c    64.0   44.0   86.0   46.0   71.0   311.0   62.2   62.2
d    59.0   97.0   71.0   42.0   56.0   325.0   65.0   65.0
합계  279.0  330.0  336.0  209.0  254.0  1408.0  281.6  281.6

In [19]:
titanic = sns.load_dataset('titanic')
titanic
round(titanic['age'].mean(), 2)

29.7

In [20]:
titanic[titanic.sex == 'female'].age.mean().round(2)

27.92

In [21]:
titanic[(titanic.pclass == 1)&(titanic.sex == 'female')].age.mean().round(2)

34.61

- apply 변환

In [22]:
df2

    V   W    X   Y   Z
a  83  91   79  78  82
b  73  98  100  43  45
c  64  44   86  46  71
d  59  97   71  42  56

In [23]:
# 각 열에서 최대값 - 최소값 한 결과
df2.apply(lambda x:x.max()-x.min())

V    24
W    54
X    29
Y    36
Z    37
dtype: int32

In [24]:
df.V.apply(lambda x: x*x)

a      6889.0
b      5329.0
c      4096.0
d      3481.0
합계    77841.0
Name: V, dtype: float64

In [25]:
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [26]:
data = {'price':['1,200','2,500','3,300'],
            'text':['03.입출력.ipynb','04.고급인덱싱.ipynb','05.데이터프레임.ipynb']
}
df3 = pd.DataFrame(data)
df3

   price             text
0  1,200     03.입출력.ipynb
1  2,500   04.고급인덱싱.ipynb
2  3,300  05.데이터프레임.ipynb

In [27]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.',''))
df3

   price             text          구둣점제거
0  1,200     03.입출력.ipynb     03입출력ipynb
1  2,500   04.고급인덱싱.ipynb   04고급인덱싱ipynb
2  3,300  05.데이터프레임.ipynb  05데이터프레임ipynb

In [28]:
# Series.str.replace(pat, repl, n=-1, case = None, flags=0, regex=None)
# pat: 문자열이나 정규표현식 / repel: 대체할 문자 / n: int,default(모든경우 변경)
# case: 대소문자 구분 True - 대소문자 구분 / False - 대소문자 구분x
# flags : int / regex: 정규표현식인지 결정 True: 정규표현식 False: 문자열
df3['한글제거'] = df3.구둣점제거.str.replace(pat='[ㄱ-ㅎㅏ-ㅣ가-힣]', repl= r'', regex=True)
df3

   price             text          구둣점제거     한글제거
0  1,200     03.입출력.ipynb     03입출력ipynb  03ipynb
1  2,500   04.고급인덱싱.ipynb   04고급인덱싱ipynb  04ipynb
2  3,300  05.데이터프레임.ipynb  05데이터프레임ipynb  05ipynb

- 연습문제 4.4.5

In [29]:
titanic.apply(pd.value_counts).fillna(titanic.age.mean()).age

0        29.699118
0.42      1.000000
0.67      1.000000
0.75      2.000000
0.83      2.000000
           ...
male     29.699118
man      29.699118
no       29.699118
woman    29.699118
yes      29.699118
Name: age, Length: 329, dtype: float64